Tekla Open API Reference for Tekla Structures 2025
GeometricPlane.GetNormal Method
 Returns a normalized normal vector of the plane.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector GetNormal()
Public Function GetNormal As Vector
Return Value
Type: Vector
The normalized normal vector of the plane.
See Also
Reference
GeometricPlane Class
Tekla.Structures.Geometry3d Namespace